Autodesk.Revit.DB.ComponentRepeater.GetIteratorInternal
Returns an iterator to the slot collection.
Returns:
The slot iterator.
Since:
2014

Autodesk.Revit.DB.ComponentRepeater.RepeatElements(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Repeats a set of adaptive component hosted on one or more repeating references.
Remarks:
All elements must be adaptive family instances, have no shape handles, and have at least one placement
point hosted on a 1D or 2D repeating reference. The remaining placement points must be either unhosted or hosted on another repeating reference.
document:
The document that contains the element.
elementIds:
The set of adaptive components used as an input pattern for the repeating operation.
Returns:
One or more component repeater objects representing the result pattern of the repeating operation.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The document does not allow creation of a component repeater.
-or-
The given element id set is empty.
-or-
One or more elements in elementIds do not exist in the document.
-or-
Some of the elements cannot be repeated. All elements must be adaptive family instances, have no shape handles, and have at least one placement
point hosted on a 1D or 2D repeating reference. The remaining placement points must be either unhosted or hosted on another repeating reference.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2014

Autodesk.Revit.DB.ComponentRepeater.GetEnumerator
Returns an enumerator that iterates through the curve loop.
Returns: An IEnumerator(Curve) object that can be used to iterate through key-value pairs in the collection.
Since:
2014